read_verilog ../gray.v ../gray64.v
splitnets
hierarchy -top binary2gray_64
flatten
proc
techmap
opt
abc -g NOR
opt
opt_clean
show -format pdf -prefix ../gray64/gray64_yosys
write_edif ../gray64/gray64.edif
write_json ../gray64/gray64.json

