read_verilog ../md5Core.v
splitnets
hierarchy -top md5Core
flatten
proc; opt -full; memory; opt -full; fsm; opt -full 
techmap; opt -full
abc -g NAND
splitnets -ports; opt -full
opt_clean
clean -purge
flatten
show -format pdf -prefix ../md5_opt_nand/md5_opt_nand_yosys
write_edif ../md5_opt_nand/md5_opt_nand.edif
write_json ../md5_opt_nand/md5_opt_nand.json
