read_verilog ../agc.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR,AND,NAND,OR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ../agc/agc_yosys
write_edif ../agc/agc.edif
write_json ../agc/agc.json
