read_verilog ../fpga_agc.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ../apollo/apollo_yosys
write_edif ../apollo/apollo.edif
write_json ../apollo/apollo.json
