read_verilog ../gray.v
splitnets
hierarchy -top binary2gray
flatten
proc
techmap
opt
abc -g NOR
opt
opt_clean
show -format pdf -prefix ../gray/gray_yosys
write_edif ../gray/gray.edif
write_json ../gray/gray.json

