read_verilog ../mux4.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ../mux4/mux4_yosys
write_edif ../mux4/mux4.edif
write_json ../mux4/mux4.json
