read_verilog ../parity.v ../parity4.v
splitnets
hierarchy -top parity4
flatten
proc
techmap
opt
abc -g NOR
opt
opt_clean
show -format pdf -prefix ../parity4/parity4_yosys
write_edif ../parity4/parity4.edif
write_json ../parity4/parity4.json

