read_verilog ../sha256_core.v ../sha256_k_constants.v ../sha256_w_mem.v ../sha256.v
splitnets
hierarchy -top sha256_core
flatten
proc
techmap
opt
abc -g all
opt
opt_clean
write_json ../sha256_all/sha256_all.json
write_edif ../sha256_all/sha256_all.edif
show -format pdf -prefix ../sha256_all/sha256_all_yosys

