read_verilog ../mux.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix ./mux/mux_yosys
write_edif ./mux/mux.edif
write_json ./mux/mux.json
