read_verilog ../md5Core.v
splitnets
hierarchy -top md5Core
flatten
proc; opt -full; memory; opt -full; fsm; opt -full 
techmap; opt -full
abc -g all,-XOR,-XNOR
splitnets -ports; opt -full
opt_clean
clean -purge
flatten
show -format pdf -prefix ../md5_opt_ExceptXORXNOR/md5_opt_ExceptXORXNOR_yosys
write_edif ../md5_opt_ExceptXORXNOR/md5_opt_ExceptXORXNOR.edif
write_json ../md5_opt_ExceptXORXNOR/md5_opt_ExceptXORXNOR.json
