read_verilog ../sha256_core.v ../sha256_k_constants.v ../sha256_w_mem.v ../sha256.v
splitnets
hierarchy auto-top
flatten
proc
techmap
opt
abc -g NOR,AND,NAND,OR
opt
opt_clean
write_json ../sha256_core/sha256_core.json
write_edif ../sha256_core/sha256_core.edif
show -format pdf -prefix ../sha256_core/sha256_core_yosys

