read_verilog ../priority_encoder4.v ../priority_encoder64.v
splitnets
hierarchy -top priority_encoder64
flatten
proc
techmap
opt
abc -g NOR
opt
opt_clean
show -format pdf -prefix ../priority_encoder64/priority_encoder64_yosys
write_edif ../priority_encoder64/priority_encoder64.edif
write_json ../priority_encoder64/priority_encoder64.json

