read_verilog ../parity.v ../parity64.v
splitnets
hierarchy -top parity64
flatten
proc
techmap
opt
abc -g NOR
opt
opt_clean
show -format pdf -prefix ../parity64/parity64_yosys
write_edif ../parity64/parity64.edif
write_json ../parity64/parity64.json

