read_verilog ../md5Core.v
splitnets
hierarchy -top md5Core
flatten
proc; opt -full; memory; opt -full; fsm; opt -full 
techmap; opt -full
splitnets -ports; opt -full
opt_clean
clean -purge
abc -g all
flatten
show -format pdf -prefix ../md5_opt_all/md5_opt_all_yosys
write_edif ../md5_opt_all/md5_opt_all.edif
write_json ../md5_opt_all/md5_opt_all.json

