read_verilog ../priority_encoder4.v
splitnets
hierarchy -top priority_encoder4
flatten
proc
techmap
opt
abc -g NOR
opt
opt_clean
show -format pdf -prefix ../priority_encoder4/priority_encoder4_yosys
write_edif ../priority_encoder4/priority_encoder4.edif
write_json ../priority_encoder4/priority_encoder4.json

